module.exports = function json(code, json) {
  return {
      code: code,
      codemsg: Code[code],
      result: json
  };
};

var Code = {
  0: '操作成功',
  1: '服务器错误',
  2: '操作数据库失败',
  3: '参数错误',
  4: '无权限操作',
  5: '附件上传失败',
  6: '登陆超时',
  7: '验证码错误',
  8: '原密码错误',
  9: '用户账号重复',
  10: '发送人接收人不能为空',
  
  //用户相关错误
  101: '手机号不存在，请确认手机号填写正确',
  102: '注册的手机号或昵称已经存在',
  103: '有多个用户存在',
  104: '该用户不存在',
  105: '您已在黑名单中,暂时不能登录',
  106: '用户不存在或密码错误',
  107: '密码错误',

  //文件上传
  500: '上传的接口没有form表单',
  512: '上传的xls文件解析错误, 请按照模板格式上传',
  555: '上传的文件没有后缀',
  566: '上传图片失败，请重新修改',

};